{#each Array(2) as _item}
    <p>
        声音其实是一种能量波，因此也有频率和振幅的特征，频率对应于时间轴线，振幅对应于电平轴线。<br>
        波是无限光滑的，弦线可以看成由无数点组成，由于存储空间是相对有限的，数字编码过程中，必须对弦线的点进行采样。
        采样的过程就是抽取某点的频率值，很显然，在一秒中内抽取的点越多，获取得频率信息更丰富。
        为了复原波形，一次振动中，必须有2个点的采样，人耳能够感觉到的最高频率为20kHz，因此要满足人耳的听觉要求，则需要至少每秒进行40k次采样，用40kHz表达，这个40kHz就是采样率。
        <br>
        
        光有频率信息是不够的，我们还必须获得该频率的能量值并量化，用于表示信号强度。
        量化电平数为2的整数次幂，我们常见的CD位16bit的采样大小，即2的16次方。
        采样大小相对采样率更难理解，因为要显得抽象点，举个简单例子：假设对一个波进行8次采样，采样点分别对应的能量值分别为A1-A8，
        但我们只使用2bit的采样大小，结果我们只能保留A1-A8中4个点的值而舍弃另外4个。
        
        如果我们进行3bit的采样大小，则刚好记录下8个点的所有信息。
        
        采样率和采样大小的值越大，记录的波形更接近原始信号。
        
        采样频率越高所能描述的声波频率就越高。 
        对于每个采样系统均会分配一定存储位（bit数）来表达声波的声波振幅状态，称之为采样分辨率或采样精度，
        每增加一个bit，表达声波振幅的状态数就翻一翻，并且增加6db的动态范围态，即6db的动态范围，
        一个2bit的数码音频系统表达千种状态，即12db的动态范围，以此类推。
        
        如果继续增加bit数则采样精度就将以非常快的速度提高，可以计算出16bit能够表达65536种状态，
        对应，96db 而20bit可以表达1048576种状态，对应120db。24bit可以表达多达16777216种状态。
        对应144db的动态范围，采样精度越高，声波的还原就越细腻。（注：动态范围是指声音从最弱到最强的变化范围）
        人耳的听觉范围通常是20HZ~20KHZ。
        采样定理表明采样频率必须大于被采样信号带宽的两倍，另外一种等同的说法是奈奎斯特频率必须大于被采样信号的带宽。
        如果信号的带宽是 100Hz，那么为了避免混叠现象采样频率必须大于 200Hz。
        
        换句话说就是采样频率必须至少是信号中最大频率分量频率的两倍，否则就不能从信号采样中恢复原始信号。
        
        根据奈魁斯特（NYQUIST）采样定理，用两倍于一个正弦波的频繁率进行采样就能完全真实地还原该波形，
        因此一个数码录音波的休样频率直接关系到它的最高还原频率指标例如，用44.1KHZ的采样频率进行采样，
        则可还原最高为22.05KHZ的频率-----这个值略高于人耳的听觉极限，
        (注： 可录MD，例R900的取样频率为44.1KHZ并且有取样频率转换器，可将输入的32KHz/44.1KHZ/48KHZ转换为该机的
        标准取样频率44.1KHZ的还原频率足已记示和真实再现世界上所有人再能辩的声音了,所以CD音频的采样规格定义为16bit。
        44KHZ， 即使在最理想的环境下用现实生活中几乎不可能制造的高精密电子元器件真实地实现了16bit的录音,仍然会受到滤波和声特定位等问题的困扰，
        人们还是能察觉出一些微小的失真所以很多专业数码音频系统已经使用18bit甚至24bit 进行录音和回放了。
    </p>
{/each}